Repository: seifalaa/FoodCam-Frontend
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Login
ar: تسجيل الدخول

source: Username
ar: أسم المستخدم

source: Password
ar: كلمة السر

source: Email
ar: البريد الألكتروني

# fname
source: First name
ar: الأسم الأول

# lname
source: Last name
ar: اللقب

# forgetPassword
source: forget your passwowrd?
ar: نسيت كلمة السر؟

source: or with
ar: أو بواسطة

source: Signup
ar: إنشاء حساب

# dontHaveAccount
source: Don't have an account?
ar: لا تمتلك حساب؟

# usernameError
source: Username cannot be empty!
ar: أسم المستخدم يجب ألا يكون فارغاً!

# passwordError
source: Password cannot be empty!
ar: كلمة السر يجب ألا تكون فارغة!

source: Welcome
ar: أهلاً بك

# knowYourName
source: Let us know your name!
ar: عرفنا بنفسك!

# haveAccount
source: Already have an account?
ar: تمتلك حساب بالفعل؟

# fnameError
source: First name cannot be empty!
ar: الأسم الأول يجب ألا يكون فارغاً!

# lnameError
source: Last name cannot be empty!
ar: اللقب يجب ألا يكون فارغاً!

source: Hi,
ar: أهلاً,

# continueAccountSetup
source: Let us continue your account setup!
ar: دعنا نكمل إعداد حسابك!

# emailError
source: Email cannot be empty!
ar: البريدالألكتروني يجب ألا يكون فارغاً!

# collectionError
source: Collection name cannot be empty !
ar: اسم المجموعة يجب ألا يكون فارغاً !

source: Repeat password
ar: أعد كلمة السر

# repeatPasswordError
source: Repeat password cannot be empty!
ar: إعادة كلمة السر يجب ألا تكون فارغة!

# repeatPasswordErrorIdentical
source: Passwords do not match!
ar: كلمات السر غير متطابقة!

source: Create
ar: إنشاء

source: Top Rated
ar: الأعلي تقيماً

source: Categories
ar: الأقسام

# recentSearch
source: Recently Searched
ar: بُحث عنه مؤخراً

source: Home
ar: الرئيسية

source: Profile
ar: الصفحة الشخصية

source: Edit profile
ar: تعديل

source: Collections
ar: المجموعات

# prefIng
source: Preferred Ingredients
ar: المكونات المفضلة

# disIng
source: Disliked Ingredients
ar: المكونات الغير مفضلة

source: Allergies
ar: الحساسيات

# lang
source: Languages
ar: اللغات

source: Logout
ar: تسجيل الخروج

source: Basket
ar: السلة

# addIngToStart
source: Add ingredients to start
ar: أضف مُكوِنات للبدأ

# addIng
source: Add Ingredient
ar: إضافة مُكوِن

# scanIng
source: Scan Ingredient
ar: إلتقط صورة للمُكوِن

# searchIng
source: Search for Ingredient
ar: أبحث عن المُكوِن

source: Nutrition Info
ar: القيمة الغذائية

source: Ingredients
ar: المُكوِنات

# steps
source: Preparation steps
ar: خطوات التحضير

source: Protein
ar: بروتين

# carb
source: Carbs
ar: كربوهيدرات

# cal
source: Calories
ar: سعرات

source: Sugar
ar: سكر

source: Fat
ar: دهون

source: Rate
ar: تقييم

source: Submit
ar: حفظ

# changeLang
source: Change Language
ar: تغيير اللغة

# startSearch
source: Start searching for recipes
ar: إبدأ بالبحث عن وصفات

# startSearchIng
source: Start searching for ingredients
ar: إبدأ بالبحث عن مُكوِنات

# noResults
source: No results found
ar: لم يتم العثور علي نتائج

# results
source: Search Results
ar: نتائج البحث

# startCollection
source: Start by adding a collection
ar: إبدأ بإضافة مجموعة

# startRecipe
source: Start by adding a recipe
ar: إبدأ بإضافة وصفة

# startPreferred
source: Start by adding preferred ingredients
ar: إبدأ بإضافة مُكوِنات مفضلة

# startDisPreferred
source: Start by adding dispreferred ingredients
ar: إبدأ بإضافة مُكوِنات غير مفضلة

source: No recently search
ar: لا يوجد بحث مؤخراً

source: Add collection
ar: أضِف مجموعة

source: Add recipe
ar: اضِف وصفة

source: Collection Name
ar: أسم المجموعة

# noAllergies
source: You have no allergies
ar: لا توجد حساسيات

source: Add Allergy
ar: أضِف حساسية

source: Random recipe
ar: وصفة عشوائية

# invalidCreds
source: Email or password is incorrect
ar: البريد الألكتروني أو كلمةالسر غير صحيحة

source: Invalid email
ar: البريد الألكتروني غير صالح

# passwordShort
source: Password must contain at least 8 characters
ar: كلمة السر يجب ألا تقل عن 8 حروف / أرقام

# loginToShowProfile
source: Login to view your profile
ar: سجِّل دخولك لتعرض صفحتك الشخصية

# loginToShowBasket
source: Login to view your basket
ar: سجِّل دخولك لتعرض السلة

# invalidPassword
source: Password must contain at least 8 ubbercase, lowercase characters, numbers,special charachters
ar: كلمة السر يجب ان تحتوي علي 8 أحرف علي الأقل (أحرف صغيرة و كبيرة, أرقام, رموز)

# userExists
source: This user already exists
ar: هذا المستخدم موجود بالفعل

# usernameExist
source: User with this username already exists
ar: مستخدم بهذا الأسم مجود بالفعل

# emailExists
source: User with this email already exists
ar: مستخدم بهذاالبريدالألكتروني موجود بالفعل

# collectionExists
source: This collection already exists
ar: هذه الموجموعة موجودة بالفعل
